Управление_пожарной_частью_/src/Documents/ПоступлениеНаСклад/ПоступлениеНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаСклад</name>
  <registerRecords>AccumulationRegister.НоменклатураНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/ПоступлениеНаСклад/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок.МасштабПечати = 135;
    ТабДок.АвтоМасштаб = Ложь; 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет = Документы.ПоступлениеНаСклад.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеНаСклад.Дата,
	|	ПоступлениеНаСклад.Комментарий,
	|	ПоступлениеНаСклад.Номер,
	|	ПоступлениеНаСклад.Организация,
	|	ПоступлениеНаСклад.Ответственный,
	|	ПоступлениеНаСклад.Склад,
	|	ПоступлениеНаСклад.ВещевоеИмущество.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Размер,
	|		Количество
	|	)
	|ИЗ
	|	Документ.ПоступлениеНаСклад КАК ПоступлениеНаСклад
	|ГДЕ
	|	ПоступлениеНаСклад.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Номер =  Макет.ПолучитьОбласть("Номер");
	Дата = Макет.ПолучитьОбласть("Дата");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВещевоеИмуществоШапка = Макет.ПолучитьОбласть("ВещевоеИмуществоШапка");
	ОбластьВещевоеИмущество = Макет.ПолучитьОбласть("ВещевоеИмущество");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Подпись = Макет.ПолучитьОбласть("Подпись");
	Комментарий = Макет.ПолучитьОбласть("Комментарий");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
        Номер.Параметры.Заполнить(Выборка);
		ТабДок.Вывести (Номер); 
		Дата.Параметры.Заполнить(Выборка);
		ТабДок.Вывести (Дата);
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВещевоеИмуществоШапка);
		ВыборкаВещевоеИмущество = Выборка.ВещевоеИмущество.Выбрать();
		Пока ВыборкаВещевоеИмущество.Следующий() Цикл
			ОбластьВещевоеИмущество.Параметры.Заполнить(ВыборкаВещевоеИмущество);
			ТабДок.Вывести(ОбластьВещевоеИмущество, ВыборкаВещевоеИмущество.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Подпись);
		Комментарий.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Комментарий);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
